export default function Terms() {
    return (
        <div
            className={`justify-center grid w-auto font-pretendard text-start bg-gradient-to-r from-white to-orange-300 pl-[14px] pr-[14px]`}>
            <h1 className={`text-[33px] font-bold text-black pt-10 pb-4`}>Boom 이용자 동의서</h1>
            <br/>
            <h2 className={`text-black font-bold text-[22px] mb-[10px]`}>1. 특별 공지</h2>
            <h2 className={`text-gray-600 font-normal text-[18px] pb-7`}>1.1 본 Boom 이용자 동의서(이하 "본 동의서")는 2024년 3월 11일에
                수정된
                것으로, Boom 앱, 저희가 개발한 <br/>
                음성 통신 애플리케이션 및 소셜 네트워크인 "Boom"를 포함한 저희의 서비스(이하 "서비스") 이용을 규정합니다. <br/>
                여러분은 하나의 당사자이며, 상대방은 Hojin Yu("저희" 또는 "Boom")입니다. 이 동의서에 따라 여러분과 <br/>
                Boom은 "당사자"로서 또는 각각 "당사자"로 칭됩니다. <br/> <br/>
                1.2 서비스를 이용하거나 등록 과정 중 "가입하기"를 클릭함으로써, 여러분은 본 동의서의 모든 조항에 동의하는 <br/>
                것입니다. 우리는 우리의 단독 재량에 따라 본 동의서를 수시로 개정할 수 있으며, 최신 버전은 다음 링크에서 확인 <br/>
                할 수 있습니다: Boom 정보 &gt; 이용자 동의서. 여러분이 계속해서 우리의 서비스를 이용하는 경우, 개정된 동의서 <br/>
                에 구속되는 것에 동의하는 것입니다. <br/><br/>

                1.3 여러분은 본인의 국가에서 법적인 연령에 도달한 경우에만 우리의 서비스를 이용할 수 있습니다. 그렇지 않은 경우,<br/>
                여러분은 해당 국가의 적용되는 법률과 규정에 따라 본 동의서에 서명하고 Boom를 사용하는 것이 제한됩니 <br/>
                다. 여러분은 미성년자임을 거짓으로 주장해서는 안 됩니다. <br/>
                <br/>
                1.4 Boom 계정과 비밀번호를 안전하게 보관하는 것은 오로지 여러분의 책임입니다. 여러분의 Boom 계정을 통해 , <br/>
                수행되는 모든 행위와 활동은 여러분의 행위와 활동으로 간주되며, 이에 대한 책임은 오로지 여러분에게 있습니다.<br/>
            </h2>
            <br/>
            <h2 className={`text-[22px] font-bold text-black mb-[10px]`}>2. 서비스 콘텐츠</h2>
            <h2 className={`text-gray-600 font-normal text-[18px] pb-7`}>2.1 우리는 우리의 서비스의 내용을 우리의 재량에 따라 수시로 변경할 수 있습니다.
                이에
                대한 사전 통지 여부는 <br/>
                우리의 재량에 따라 결정됩니다. <br/><br/>

                2.2 Boom은 정기적이거나 비정기적인 수리 및 유지 보수 작업이 필요할 수 있습니다. 이러한 상황으로 인해 유료 <br/>
                서비스가 합리적인 기간 동안 중단되는 경우, Boom은 여러분과/또는 제3자에게 어떠한 책임도 지지 않습니다. 그 <br/>
                러나 Boom은 가능한 한 빠르게 여러분에게 통지할 것입니다. <br/><br/>

                2.3 Boom은 다음과 같은 사건이 발생할 경우 본 동의서에 따른 서비스의 중지, 종료 또는 제공 제한을 언제든지 <br/>
                할 권리가 있으며, 여러분 또는 제3자에게 어떠한 책임도 지지 않습니다: <br/><br/>

                2.3.1 여러분이 Boom 서비스를 받기에 법적 연령이 되지 않은 경우; <br/><br/>

                2.3.2 여러분이 본 동의서에서 규정된 이용 약관을 위반한 경우; <br/><br/>

                2.5 본 동의서에 명시된 명시적 표현 및 보증을 제외하고, Boom은 본 동의서의 대상과 관련하여 어떠한 보증도 하지 <br/>
                않으며, 법적, 명시적 또는 묵시적인 모든 다른 보증, 포함하여 소유권, 비침해성, 상품성, 특정 목적에의 적합성 <br/>
                및 거래나 성과에 따른 묵시적인 보증을 포함한 어떠한 묵시적인 보증도 여기에 명시적으로 부인합니다.<br/>
            </h2>
            <br/>
            <h2 className={`text-[22px] font-bold text-black mb-[10px]`}>3. 개인정보</h2>
            <h2 className={`text-gray-600 font-normal text-[18px] pb-7`}>3.1 여러분은 저희가 여러분이 제공하거나 저희의 서비스를 이용할 때 생성되는
                데이터를
                처리하는 방법을 설명하 <br/>
                는 개인정보 처리방침을 읽고 이해했다고 인정합니다. 궁금한 점이 있으시면dev@entryer.com으로 문의해주십시오.
            </h2>
            <br/>
            <h2 className={`text-[22px] font-bold text-black mb-[10px]`}>4. 이용 약관</h2>
            <h2 className={`text-gray-600 font-normal text-[18px] pb-7`}>4.1 여러분은 여러분이 Boom에 제공하는 정보의 정확성에 대한 책임을 집니다.
                Boom의
                요청에 따라 제공한 정 <br/>
                보의 정확성을 확인해야 합니다. <br/><br/>

                4.2 여러분은 다른 사람을 대신하여 Boom 계정을 생성하거나 다른 사람에게 여러분의 Boom 계정을 사용하게 <br/>
                허용할 수 없습니다. 다른 사람이 여러분의 계정을 불법적으로 사용하는 것을 발견한 경우에는 즉시 Boom에 알려야 합니다. <br/><br/>

                4.3 우리의 서비스를 고려하여, 여러분은 Boom이 광고나 다른 형태의 상업 정보를 게재할 권리가 있음에 동의합니다. <br/>
                또한, 여러분은 이메일이나 기타 방법을 통해 Boom으로부터 광고나 기타 관련 상업 정보를 수신하는 것에 동의합니다. <br/><br/>

                4.4 Boom 서비스를 사용하는 동안에는 모든 관련 법률과 규정, 그리고 Boom의 모든 규칙과 정책을 준수해야 합니다. <br/><br/>

                4.5 여러분은 공개해도 괜찮은 정보만 공유할 수 있습니다. Boom을 통해 다음과 같이 간주될 수 있는 어떠한 <br/>
                콘텐츠도 배포해서는 안됩니다: <br/><br/>

                4.5.1 포르노, 음란 또는 외설적이거나 성인 콘텐츠, 아동 성 착취와 관련된 어떠한 형태의 내용; <br/><br/>

                4.5.2 과도하게 폭력적인, 죽음이나 심각한 부상과 관련된 어떠한 내용; <br/><br/>

                4.5.3 자살이나 자해를 묘사하거나 조장 또는 지원하는 어떠한 내용; <br/><br/>

                4.5.4 소문, 잘못된 정보; <br/><br/>

                4.5.5 혐오스러운 발언이나 행동, 인종 차별, 테러주의, 연령차별 또는 성차별을 조장하는 어떠한 내용; <br/><br/>

                4.5.6 불손하거나 신앙을 가진 사람들을 모욕할 수 있는 내용, 또는 종교와 관련된 어떠한 내용; <br/><br/>

                4.5.7 도박, 낙태, 무기 또는 기타 매우 논란이 될 수 있는 주제와 관련된 내용; <br/><br/>

                4.5.8 폭력적이거나 명예 훼손적이며 다른 사람이나 그룹에 괴롭히는 내용; <br/><br/>

                4.5.9 스팸, 승인되지 않은 광고 메일 또는 기타 불요한 광고; <br/><br/>

                4.5.10 Boom의 판단에 따라 부정적인 내용이거나 배포에 적합하지 않은 다른 내용들. <br/><br/>

                4.6 여러분은 다른 개인, 단체, 정부 기관 또는 기관을 가장하여서는 안 됩니다. <br/><br/>

                4.7 다른 사람들의 사적인 정보를 그들의 명시적인 승인과 허가 없이 공개하거나 배포해서는 안 됩니다. <br/><br/>

                4.8 여러분은 저작권 또는 소유권이 있는 작품을 게시하거나 배포하기 위해 필요한 라이선스, 권리, 동의 및 허가를 <br/>
                소유하거나 보유하고 있다고 당언하며 보증합니다. 이러한 라이선스, 권리, 동의 및 허가를 확보하는 것은 여러분의 책임입니다. <br/><br/>

                4.9 여러분은 악성 코드, 피싱 웹사이트 또는 인터넷의 보안을 위협할 수 있는 기타 내용을 게시하거나 링크해서는 안 됩니다. <br/><br/>

                4.10 Boom은 여러분의 Boom에서의 행동을 검토하고 모니터링할 권리가 있습니다. Boom은 자체적인 재량에 따라 여러분이 이용 <br/>
                약관을 위반했다고 합리적으로 판단하는 경우 여러분의 계정을 동결, 정지, 비활성화, 금지 또는 취소할 수 있습니다. <br/><br/>

                4.11 여러분의 계정이 동결, 정지, 비활성화, 금지 또는 취소된 경우, 여러분은 두 번째 계정을 생성하거나 누군가에게 두 번째 <br/>
                계정 생성을 요청해서는 안 됩니다. <br/><br/>

                4.12 여러분이 이용약관을 위반하는 경우, 여러분은 이에 대한 책임으로서 제3자로부터의 클레임으로 인한 Buz의 책임을 보상하고 <br/>
                면책시켜야 합니다.<br/>
            </h2>
            <br/>
            <h2 className={`text-[22px] font-bold text-black mb-[10px]`}>5. 지적 재산권</h2>
            <h2 className={`text-gray-600 font-normal text-[18px] pb-7`}>5.1 Boom이 제공하는 서비스 내의 모든 텍스트, 데이터, 이미지, 그래픽,
                오디오
                및/또는 비디오 정보 및 기타 자료는 <br/>
                Boom의 소유물이며, 저작권, 상표 및/또는 기타 재산권 법에 의해 보호됩니다. 본 약관에 따라 Boom이 여 <br/>
                러분에게 해당 자료의 지적 재산권 또는 이러한 자료에 대한 어떠한 라이선스도 부여하지 않는다는 것을 의미합니다. <br/><br/>

                5.2 여러분이 Boom의 서비스를 통해 어떠한 콘텐츠를 업로드하거나 제출하거나 저장하거나 전송하거나 수신하는 경우, <br/>
                여러분은 Boom과 그 하위 라이선시에게 해당 콘텐츠에 대한 허락을 부여하며, 허가는 무료, 영구적, 취소 불가능한, <br/>
                비독점적이고 완전히 하위 라이선스 가능한 권리와 라이선스로서 어떠한 지리적 또는 시간적 제한도 없으며 어떠한 승인 <br/>
                및/또는 보상도 요구하지 않고, 해당 콘텐츠를 사용, 복제, 수정, 적응, 출판, 번역, 편집, 처분, 파생 작품을 작성하고, <br/>
                배포, 실행 및 공개적으로 표시(전체 또는 부분적으로)하고/또는 해당 콘텐츠를 기존 또는 향후의 작업, 미디어 또는 기술 형태에 <br/>
                편입시키는 권리를 갖습니다.<br/>
            </h2>
            <br/>
            <h2 className={`text-[22px] font-bold text-black mb-[10px]`}>6. 서비스 종료</h2>
            <h2 className={`text-gray-600 font-normal text-[18px] pb-7`}>6.1 여러분은 Boom 서비스와 본 약관을 여러분의 Boom 계정을 철회함으로써
                종료할 수
                있습니다. 여러분은 다 <br/>
                음 주소로 연락할 수 있습니다: dev@entryer.com
            </h2>
            <br/>
            <h2 className={`text-[22px] font-bold text-black mb-[10px]`}>8. 면책 조항</h2>
            <h2 className={`text-gray-600 font-normal text-[18px] pb-7`}>8.1 Boom 서비스를 사용함에 따라 발생하는 모든 위험에 대해 여러분은 완전히
                책임을
                집니다. Boom 서비스의 <br/>
                사용 또는 의존은 여러분의 자체적인 책임 하에 이루어집니다. <br/><br/>

                8.2 Boom는 어떠한 경우에도 Boom 서비스가 여러분의 요구를 충족시키거나, Boom 서비스가 중단되지 않을 것을 <br/>
                보장하지 않습니다. 또한, Boom 서비스의 적시성, 안전성 및 정확성도 보장하지 않습니다. 여러분은 Boom 서비스가 <br/>
                "있는 그대로" 제공된다는 것을 인정하고 동의합니다. Boom은 Boom 서비스 또는 그 일부에 대한 운영 및 제공에 대해 <br/>
                명시적 또는 암묵적인 어떠한 종류의 표현이나 보증도 하지 않습니다. Boom은 Boom 서비스의 품질, 적시성, 정확성 또는 <br/>
                완전성에 대해 어떠한 방식으로도 책임을지지 않으며, 여러분이 이러한 서비스를 사용함으로써 발생할 수 있는 어떠한 결과에 <br/>
                대해서도 책임을지지 않습니다. <br/><br/>

                8.3 Boom은 서비스 사용을 위해 접근 가능한 어떠한 외부 링크의 정확성과 무결성도 보장하지 않습니다. 또한 여러분의 편의를 <br/>
                위해 배치된 어떠한 외부 링크의 콘텐츠에 대해서도 Boom은 책임을지지 않으며, Boom은 여러분의 사용과 관련하여 발생하는 어떠한 <br/>
                손실이나 피해에 대해서도 직접적이거나 간접적인 책임을지지 않습니다. 게다가, Boom의 통제 범위가 아닌 외부 링크를 통해 이동하는 <br/>
                어떠한 웹페이지의 콘텐츠에 대해서도 Boom은 어떠한 책임도 지지 않습니다. <br/><br/>

                8.4 Boom은 불가항력적인 사정에 의해 또는 Boom의 통제 범위를 벗어난 다른 사유로 인해 서비스의 중단 또는 기타 불완전성에 대한 어떠한 <br/>
                책임도지지 않습니다. 그러나 최대한 가능한 한 Boom은 여러분에게 발생하는 손실과 영향을 합리적으로 최소화하기 위해 노력할 것입니다.<br/>
            </h2>
            <br/>
            <h2 className={`text-[22px] font-bold text-black mb-[10px]`}>9. 법적 관할권</h2>
            <h2 className={`text-gray-600 font-normal text-[18px] pb-7`}>9.1 본 계약은 대한민국 법에 따라 해석되고 규율됩니다. 법적 문제 또는 이 계약의
                존재, 유효성 또는 종료와 관련 <br/>
                된 모든 분쟁은 Boom 등록 주소의 관할 인민법원에 회부되어 최종적으로 해결될 것입니다.</h2>
            <br/>
            <h2 className={`text-[22px] font-bold text-black mb-[10px]`}>10. 기타 조항</h2>
            <h2 className={`text-gray-600 font-normal text-[18px] pb-7`}>10.1 본 계약은 양 당사자 간 합의된 사항 및 기타 관련 사항의 전부를
                구성합니다. 본 계약에 명시된 사항 외에는 본 계약 당사자에게 다른 권리가 인정되지 않습니다. <br/><br/>

                10.2 본 계약의 어떤 조항이라도 관할 권한을 가진 당국에 의해 전체 또는 부분적으로 어떤 이유로든 무효화되거나 강제되는 경우에도, 본 계약의 남은 조항은 유효하고 구속력을
                유지합니다. <br/><br/>

                10.3 본 계약 내의 제목은 편의를 위해 설정되었으며, 본 계약의 해석에 있어서는 무시됩니다. <br/><br/>

            </h2>
            <span className={`text-[20px] font-bold text-black`}>Hojin Yu</span> <br/>

            <span className={`text-[20px] font-bold text-black pb-10`}>12-9, Janggunbong 3-gil, Gwanak-gu, Seoul, Republic of Korea</span>
            <br/>
        </div>
    )
}